In [73]:
import pandas as pd
import numpy as np

In [74]:
churn = pd.read_csv('Bank Customer Churn Prediction.csv')

In [75]:
churn_customers = churn[churn['churn'] == 1]

In [76]:
percent_of_churn = round(len(churn_customers) / len(churn) * 100, 2)

In [77]:
f"Customers who have churned make up {percent_of_churn}% of the dataset."

'Customers who have churned make up 20.37% of the dataset.'

In [78]:
churn.shape

(10000, 12)

In [79]:
churn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       10000 non-null  int64
 1   credit_score      10000 non-null  int64
 2   country           10000 non-null  object
 3   gender            10000 non-null  object
 4   age               10000 non-null  int64
 5   tenure            10000 non-null  int64
 6   balance           10000 non-null  float64
 7   products_number   10000 non-null  int64
 8   credit_card       10000 non-null  int64
 9   active_member     10000 non-null  int64
 10  estimated_salary  10000 non-null  float64
 11  churn             10000 non-null  int64
dtypes: float64(2), int64(8), object(2)
memory usage: 937.6+ KB

In [80]:
churn.gender.value_counts()

gender
Male      5457
Female    4543
Name: count, dtype: int64

In [81]:
churn.country.value_counts()

country
France     5014
Germany    2509
Spain      2477
Name: count, dtype: int64

In [82]:
churn.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [83]:
churn = churn.rename(columns = {'products_number': 'number_of_products'})
churn = churn.rename(columns = {'tenure': "tenure_years"})

In [84]:
churn.head()

,customer_id,credit_score,country,gender,age,tenure_years,balance,number_of_products,credit_card,active_member,estimated_salary,churn
0,15634602,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

Customer Id wont be a useful feature for the sake of of our analysis so I'll go ahead and remove it now.

In [85]:
churn = churn.drop(columns = 'customer_id')

In [86]:
churn.head()

,credit_score,country,gender,age,tenure_years,balance,number_of_products,credit_card,active_member,estimated_salary,churn
0,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [87]:
churn.dtypes

credit_score            int64
country                object
gender                 object
age                     int64
tenure_years            int64
balance               float64
number_of_products      int64
credit_card             int64
active_member           int64
estimated_salary      float64
churn                   int64
dtype: object

Data types appear to be in order.

In [88]:
if sum(churn.duplicated()) == 0:
    print("No Duplicates")
else: print("There's Duplicates")

No Duplicates

In [89]:
if sum(churn.isna().sum()) == 0: 
    print("No Missing Values")
else: print("There's missing values")

No Missing Values